
-- 参数一：work_no
-- 参数二：训练次数，改参数可在一波训练后，修改为更大次数，继续准备->执行
call sm_sc.prc_nn_prepare_p
(
  i_work_no             =>  -000000019  
, i_limit_train_times   =>  100              
, i_batch_amt_per_range =>  array_fill(2, array[12])
, i_batch_range         =>  
  array
  [
    int4range(    1,   40, '[]')
  , int4range(   51,   90, '[]')
  , int4range(  101,  150, '[]')
  , int4range(  151,  190, '[]')
  
  , int4range(  201,  240, '[]')
  , int4range(  251,  290, '[]')
  , int4range(  301,  350, '[]')
  , int4range(  351,  390, '[]')
  
  -- , int4range(  401,  440, '[]')
  -- , int4range(  451,  490, '[]')
  -- , int4range(  501,  550, '[]')
  -- , int4range(  551,  590, '[]')
  -- 
  -- , int4range(  601,  640, '[]')
  -- , int4range(  651,  690, '[]')
  -- , int4range(  701,  750, '[]')
  -- , int4range(  751,  790, '[]')
  -- 
  -- , int4range(  801,  840, '[]')
  -- , int4range(  851,  890, '[]')
  -- , int4range(  901,  950, '[]')
  -- , int4range(  951,  990, '[]')
  -- 
  -- , int4range( 1001, 1040, '[]')
  -- , int4range( 1051, 1090, '[]')
  -- , int4range( 1101, 1150, '[]')
  -- , int4range( 1151, 1190, '[]')
  -- 
  -- , int4range( 1201, 1240, '[]')
  -- , int4range( 1251, 1290, '[]')
  -- , int4range( 1301, 1350, '[]')
  -- , int4range( 1351, 1390, '[]')
  -- 
  -- , int4range( 1401, 1440, '[]')
  -- , int4range( 1451, 1490, '[]')
  -- , int4range( 1501, 1550, '[]')
  -- , int4range( 1551, 1590, '[]')
  
  , int4range( 1601, 1640, '[]')
  , int4range( 1651, 1690, '[]')
  , int4range( 1701, 1750, '[]')
  , int4range( 1751, 1790, '[]')
  
  -- , int4range( 1801, 1840, '[]')
  -- , int4range( 1851, 1890, '[]')
  -- , int4range( 1901, 1950, '[]')
  -- , int4range( 1951, 1990, '[]')
  -- --   int4range(    1,   180, '[]')
  -- -- , int4range(  201,   380, '[]')
  -- -- , int4range(  401,   580, '[]')
  -- -- , int4range(  601,   780, '[]')
  -- -- , int4range(  801,   980, '[]')
  -- -- , int4range( 1001,  1180, '[]')
  -- -- , int4range( 1201,  1380, '[]')
  -- -- , int4range( 1401,  1580, '[]')
  -- -- , int4range( 1601,  1780, '[]')
  -- -- , int4range( 1801,  1980, '[]')
  -- --   int4range(    1,  4000, '[]')
  -- -- , int4range( 5924,  9924, '[]')
  -- -- , int4range(12666, 16666, '[]')
  -- -- , int4range(18624, 22624, '[]')
  -- -- , int4range(24755, 28755, '[]')
  -- -- , int4range(30597, 34597, '[]')
  -- -- , int4range(36018, 40018, '[]')
  -- -- , int4range(41936, 45936, '[]')
  -- -- , int4range(48201, 52201, '[]')
  -- -- , int4range(54053, 58053, '[]')
  -- -- --   array[1    , 5924 , 12666, 18624, 24755, 30597, 36018, 41936, 48201, 54053]
  -- -- -- , array[4000 , 9924 , 16666, 22624, 28755, 34597, 40018, 45936, 52201, 58053]   -- 每类别 4000 共 40000， 当做训练集
  ]
);
